Repository: ChrisHal/flatpak-docs
Catalog: po/*/LC_MESSAGES/basic-concepts.po
Languages: de, fr

source: Basic concepts
de: Grundlegende Konzepte
fr: Concepts de base

source: Flatpak can be understood through a small number of key concepts. It is useful to be familiar with these before learning about how to use Flatpak from the command line, or using it to build applications.
de: Flatpak wird verständlich durch eine kleine Zahl an Schlüsselkonzepten. Es ist sinnvoll, mit diesen vertraut zu sein, bevor man lernt Flatpak auf der Kommandozeile zu verwenden oder um Applikationen zu generieren.
fr: Flatpake peut être compris à travers un petit nombre de concepts clé. Il est utile d'être familiers avec ceux-ci avant d'apprendre comment utiliser Flatpak à partir de la ligne de commande ou de l'utiliser pour construire des applications.

source: Runtimes
de: Laufzeitumgebungen

source: Runtimes provide the basic dependencies that are used by applications. Each application must be built against a runtime, and this runtime must be installed on a host system in order for the application to run (Flatpak can automatically install the runtime required by an application). Multiple different runtimes can be installed at the same time, including different versions of the same runtime.
de: Laufzeitumgebungen beinhalten die grundlegenden Abhängigkeiten, die von den Anwendungen verwendet werden. Jede Anwendung muss gegen eine Laufzeitumgebung erzeugt werden und diese Laufzeitumgebung muss auf einem Gastsystem installiert sein, als Voraussetzung damit die Anwendung lauffähig ist (Flatpak kann die Laufzeitumgebung, die von einer Applikation benötigt wird, automatisch installieren). Es können mehrere unterschiedliche Laufzeitumgebungen zur gleichen Zeit installiert werden, dies beinhaltet auch verschiedene Versionen der gleichen Laufzeitumgebung.
fr: Les runtimes fournissent les dépendances de base utilisées par les applications. Chaque application doit être construite sur un runtime, et ce runtime doit être installé sur un système hôte pour que l'application s'exécute (Flatpak peut installer automatiquement le runtime requis par une application). Plusieurs runtimes différents peuvent être installés en même temps, y compris différentes versions du même runtime.

source: Runtimes are distribution agnostic and do not depend on particular distribution versions. This means that they provide a stable, cross-distribution base for applications, and allow applications to continue to work irrespective of operating system updates.
de: Laufzeitumgebungen sind unabhängig von Distributionen und sind auch nicht auf bestimmte Versionen dieser angewiesen. Das bedeutet, dass sie eine stabile und distributionsübergreifende Basis für Anwendungen darstellen und diesen erlauben weiterzuarbeiten – unabhängig von Aktualisierungen des Betriebssystems.
fr: Les runtimes sont indépendants de la distribution et ne dépendent pas de versions de distribution particulières. Cela signifie qu'ils fournissent une base multi-distribution stable pour les applications et permettent aux applications de continuer à fonctionner indépendamment des mises à jour du système d'exploitation.

source: Bundled libraries
de: Gebündelte Bibliotheken
fr: Bibliothèques groupées

source: If an application requires any dependencies that aren't in its runtime, they can be bundled as part of the application. This gives application developers flexibility regarding the dependencies that they use, including using:
de: Wenn eine Anwendung Abhängigkeiten benötigt, die nicht in seiner Laufzeitumgebung vorhanden sind, können diese gebündelt werden als Teil der Applikation. Dies gibt Anwendungsentwicklern Flexibilität im Hinblick auf die Abhängigkeiten, die sie verwenden. Dies beinhaltet die Verwendung von:
fr: Si une application nécessite des dépendances qui ne sont pas dans son environnement d'exécution, elles peuvent être regroupées dans le cadre de l'application. Cela donne aux développeurs d'applications une flexibilité concernant les dépendances qu'ils utilisent, notamment en utilisant :

source: patched versions of libraries
de: gepatchte Versionen von Bibliotheken
fr: versions corrigées des bibliothèques

source: Sandboxes
de: Sandboxen
fr: Bacs à sable

source: With Flatpak, each application is built and run in an isolated environment, which is called the 'sandbox'. Each sandbox contains an application and its runtime. By default, the application can only access the contents of its sandbox. Access to user files, network, graphics sockets, subsystems on the bus and devices have to be explicitly granted. Access to other things, such as other processes, is deliberately not possible.
de: Mit Flatpak wird jede Applikation in einer isolierten Umgebung erzeugt und gestartet, diese wird als »Sandbox« bezeichnet. Jede Sandbox beinhaltet eine Applikation und seine Laufzeitumgebung. Standardmäßig kann die Anwendung lediglich auf die Inhalte seiner Sandbox zugreifen. Zugriff auf Benutzerdateien, Netzwerk, Grafiksockets, Subsysteme auf dem Bus und Geräten muss ausdrücklich erteilt werden. Zugriff auf andere Dinge, so wie andere Prozesse, ist bewusst nicht möglich.
fr: Avec Flatpak, chaque application est construite et exécutée dans un environnement isolé, appelé « bac à sable » (sandbox). Chaque sandbox contient une application et son environnement d'exécution. Par défaut, l'application ne peut accéder qu'au contenu de son bac à sable. L'accès aux fichiers utilisateur, au réseau, aux sockets graphiques, aux sous-systèmes sur le bus et aux périphériques doit être explicitement autorisé. L'accès à d'autres choses, comme d'autres processus, est délibérément impossible.

source: By necessity, some resources that are inside the sandbox need to be exposed outside, to be used by the host system. These are known as 'exports', since they are files that are exported out of the sandbox, and include things like the application's ``.desktop`` file and icon.
de: Einige Ressourcen, die innerhalb der Sandbox liegen, müssen bei Bedarf nach außen freigegeben werden, um vom Gastsystem verwendet zu werden. Diese sind bekannt als »Exports«, da dies Dateien sind, die aus der Sandbox heraus exportiert werden und Dinge enthalten wie die ``.desktop``-Datei und Icon einer Anwendung.
fr: Par nécessité, certaines ressources qui se trouvent à l'intérieur du bac à sable doivent être exposées à l'extérieur pour être utilisées par le système hôte. Celles-ci sont appelées « exports », car ce sont des fichiers qui sont exportés hors du bac à sable et incluent des éléments tels que le fichier et l’icône « .desktop » de l’application.

source: Portals
de: Portale
fr: Portails

source: Portals are a mechanism through which applications can interact with the host environment from within a sandbox. They give the ability to interact with data, files and services without the need to add sandbox permissions.
de: Portale sind ein Mechanismus durch den Applikationen, aus einer Sandbox heraus, mit der Gastumgebung interagieren können. Sie geben die Möglichkeit mit Daten, Dateien und Diensten zu interagieren, ohne die Notwendigkeit Sandbox-Berechtigungen hinzuzufügen.
fr: Les portails sont un mécanisme par lequel les applications peuvent interagir avec l'environnement hôte à partir d'un bac à sable. Ils donnent la possibilité d'interagir avec des données, des fichiers et des services sans avoir besoin d'ajouter des autorisations de bac à sable.

source: Examples of capabilities that can be accessed through portals include opening files through a file chooser dialog, or printing. Interface toolkits can implement transparent support for portals, so access to resources outside of the sandbox will work securely and out of the box.
de: Beispiele für Ressourcen, auf die durch Portale zugegriffen werden kann, beinhalten das Öffnen von Dateien mittels eines Dateiauswahldialogs oder Drucken. Interface-Toolkits können eine transparente Unterstützung für Portale implementieren, sodass der Zugriff auf Ressourcen außerhalb der Sandbox sicher und out-of-the-box funktioniert.
fr: Des exemples de fonctionnalités accessibles via des portails incluent l'ouverture de fichiers via une boîte de dialogue de sélection de fichiers ou l'impression. Les outils d'interface peuvent mettre en œuvre une prise en charge transparente des portails, de sorte que l'accès aux ressources en dehors du bac à sable fonctionnera de manière sécurisée et immédiate.

source: More information about portals can be found in :doc:`sandbox-permissions`.
de: Weitere Informationen zu Portalen können unter :doc:`sandbox-permissions` gefunden werden.
fr: D'avantages d'informations à propos des portails peut être trouvés dans :doc:`sandbox-permissions`.

source: Repositories
de: Repositorys
fr: Dépôts

source: Flatpak applications and runtimes are typically stored and published using repositories, which behave very similarly to Git repositories. A Flatpak repository can contain a single object or multiple objects, and each object is versioned, which allows upgrading and even downgrading.
de: Anwendungen und Laufzeitumgebungen von Flatpaks werden normalerweise gespeichert und veröffentlicht unter Verwendung von Repositorys, die sich sehr ähnlich zu Git-Repositorys verhalten. Ein Flatpak-Repository kann ein einziges Objekt oder mehrere enthalten, jedes Objekt ist dabei versioniert, was upgraden und sogar downgraden ermöglicht.
fr: Les applications et les environnements d'exécution Flatpak sont généralement stockés et publiés à l'aide de dépôts, qui se comportent de manière très similaire aux dépôts Git. Un dépôt Flatpak peut contenir un seul objet ou plusieurs objets, et chaque objet est versionné, ce qui permet une mise à niveau et même une rétrogradation.

source: Each system which is using Flatpak can be configured to access any number of remote repositories. Once a system has been configured to access a 'remote', the remote repository's content can be inspected and searched, and it can be used as the source of applications and runtimes.
de: Jedes System, das Flatpak verwendet, kann konfiguriert werden auf jegliche Anzahl von Repositorys zuzugreifen. Sobald ein System konfiguriert wurde auf ein »Remote« zuzugreifen, kann der Inhalt der Remote-Repositorys inspiziert und durchsucht werden.
fr: Chaque système qui utilise Flatpak peut être configuré pour accéder à n'importe quel nombre de dépôts distants. Une fois qu'un système a été configuré pour accéder à un « distant », le contenu du dépôt distant peut être inspecté et recherché, et il peut être utilisé comme source d'applications et de runtimes.

source: When an update is performed, new versions of installed applications and runtimes are downloaded from the relevant remotes. Like with Git, only the difference between versions is downloaded, which makes the process very efficient.
de: Wenn eine Aktualisierung durchgeführt wird, werden neue Versionen der installierten Anwendungen und Laufzeitumgebungen von dem relevanten Remote heruntergeladen. Wie mit Git, werden lediglich Unterschiede zwischen Versionen heruntergeladen, was den Prozess sehr effizient macht.
fr: Lorsqu'une mise à jour est effectuée, les nouvelles versions des applications installées et des runtimes sont téléchargées à partir des dépôts concernés. Comme avec Git, seule la différence entre les versions est téléchargée, ce qui rend le processus très efficace.
