Repository: ChrisHal/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder-tutorial.po
Languages: pt_br

source: This tutorial provides a sample set of step that you can use to try ``flatpak-builder`` yourself. In it, you will learn how to use ``flatpak-builder`` to build the GNOME Dictionary applicaiton.
pt_br: Este tutorial fornece um conjunto de amostra que você pode usar para testar o ''flatpak-builder'' você mesmo. Nele, você irá aprender como usar o "flatpak-builder" para construir a aplicação do Dicionário GNOME.

source: 1. Create a manifest
pt_br: 1. Criar um manisfesto

source: To create a manifest for the application, create a file called ``org.gnome.Dictionary.json`` and paste the Dictionary manifest JSON from :doc:`manifests` into it.
pt_br: Para criar um manifesto para a aplicação, crie um arquivo chamado "org.gnome.Dictionary.json" e cole o JSON do manifesto do Dicionário de :doc:'manisfests' para ele.

source: 2. Run the build
pt_br: 2. Rodar o projeto

source: To use the manifest to build the Dictionary application, run the following command::
pt_br: Para usar o manifesto para construir a aplicação do Dicionário, execute o seguinte comando:

source: This will:
pt_br: Isto irá:

source: Create a new directory called dictionary
pt_br: Crie um novo diretório chamado dicionário

source: Download and verify the Dictionary source code
pt_br: Baixe e verifique o código-fonte do Dicionário

source: Build and install the source code, using the SDK rather than the host system
pt_br: Configure e instale o código-fonte, usando o SDK ao invés do sistema hospedeiro

source: Finish the build, by setting permissions (in this case giving access to X11 and the network)
pt_br: Finalize o projeto, configurando permissões (neste caso, dando acesso para X11 e a rede)

source: Create a new repository called repo (if it doesn't exist) and export the resulting build into it
pt_br: Crie um novo repositório chamado repo (se ele não existe) e exporte o projeto resultante para ele

source: ``flatpak-builder`` will also do some other useful things, like creating a separately installable debug runtime (called ``org.gnome.Dictionary.Debug`` in this case) and a separately installable translation runtime (called ``org.gnome.Dictionary.Locale``).
pt_br: ''flatpak-builder'' irá também fazer algumas outras coisas úteis, como criar uma execução de depuração instalável separadamente (chamado "org.gnome.Dictionary.Debug'' neste caso) e uma execução de tradução instalável separadamente (chamado ''org.gnome.Dictionary.Locale'').

source: 3. Add the new repository
pt_br: 3. Adicionar o novo repositório

source: To test the application that has been built, you need to add the new repository that has been created::
pt_br: Para testar a aplicação, que foi configurada, você precisa adicionar o novo repositório que foi criado::

source: 4. Install the application
pt_br: 4. Instalar a aplicação

source: The next step is to install the Dictionary application from the repository. To do this, run::
pt_br: O próximo passo é instalar o aplicação Dicionário a partir do repositório. Para fazer isto, execute::

source: To check that the application has been successfully installed, you can compare the sha256 commit of the installed app with the commit ID that was printed by ``flatpak-builder``::
pt_br: Para verificar que a aplicação foi instalada com sucesso, você pode comparar o commit sha256 da app instalado como o ID do commit que foi imprimido pelo "flatpak-builder"::

source: 5. Run the application
pt_br: 5. Execute a aplicação

source: Finally, you can run the application that you've built::
pt_br: Finalmente, você pode executar a aplicação que você projetou::
